package com.example.yuntechflowerv1.flowers

object FlowerData {
    val allFlower = listOf(
        FlowersItem(
            0,
            "Daisy",
            "雛菊",
            "Bellis perennis",
            "深藏在心底的愛、永遠的快樂、希望見到你、幸福、純真、謙遜、樸素",
            "有收斂和止血效果，常用於傳統醫學中",
            "高10－20厘米，常綠，小葉根生，長2－5厘米，圓形或勺形，被柔毛，葉緣細鋸齒狀，貼地生長。 頭狀花序直徑2－3厘米，由頂端紅色的白色舌狀花和黃色管狀花組成，通常生長在2－10厘米高的裸莖上。多花小輪種花序直徑2厘米，大輪種花序近10厘米。舌狀花多層，為重瓣花型，花色有紅、白、粉及複色，與中心的黃色管狀花相映成美。花型有單瓣和重瓣。",
            "雛菊屬",
            "菊科"
        ),
        FlowersItem(
            1,
            "Rose",
            "玫瑰",
            "Rosa hybrid",
            "愛情、愛與美",
            "花蕾入藥治肝、胃氣痛、胸腹脹滿和月經不調。",
            "薔薇屬常綠或落葉，灌木或木質藤本，是原產歐、亞、美洲大陸北半球的薔薇屬植物園藝雜交品種群，品種超過3萬種。樹高1~3m，枝直立或斜伸，樹皮有刺。互生奇數羽狀複葉，橢圓形至卵形小葉3~9片，葉緣有鋸齒，小葉長2~15cm、寬1~5cm。花單生或繖房花序自枝端開出。花瓣基數5枚，園藝品種多為雄蕊瓣化的重瓣品種，花瓣數通常超過50枚。花徑1~15cm，花型、花色豐富多變，通常有芳香。單瓣品種能結果，紅色或橘紅色果實圓形至橢圓形，直徑約1cm。開花期全年。",
            "薔薇屬",
            "薔薇科"
        ),
        FlowersItem(
            2,
            "Sunflower",
            "向日葵",
            "Helianthus annuus L",
            "沉默的愛、忠誠",
            "有透疹，止痢，透癰膿之功效。",
            "向日葵屬一年生草本，原產北美洲。全株有毛。健壯莖直立，不分枝或少分枝，株高0.5~3m。互生心狀卵圓形或卵圓形葉，長10~40cm、寬5~40cm，葉緣有粗鋸齒。頭狀花序單生莖端，多花品種生於枝端與葉腋。花序直徑6~30cm。舌狀花黃、橘、紫黑等色，管狀花黃、棕或紫色，有管狀花變成舌狀花的重瓣狀品種。開花期全年。",
            "薔薇屬",
            "薔薇科"
        ),
        FlowersItem(
            3,
            "Dandelion",
            "蒲公英",
            "Taraxacum",
            "我在遠處為你的幸福而祈禱",
            "蒲公英主治婦人乳癰腫，水煮汁飲及封之立消。解食毒，散滯氣，清熱毒，化食毒，消惡腫、結核、疔腫。",
            "蒲公英為多年生草本植物，花莖是空心的，折斷之後有白色的乳汁。匙形或狹長倒卵形的葉子呈蓮座狀平鋪，羽狀淺裂或齒裂。春季花期為4至5月，秋季花期為8至9月。冬末春初抽花莖，頂端生一頭狀花序。花為亮黃色，由很多細花瓣組成。果實成熟之後，形似一白色絨球，含許多先端帶冠毛的瘦果，冠毛由花萼變成，被風吹過會分散為帶著一粒種子的小白傘，隨風飄到新的地方孕育新生命。",
            "蒲公英屬",
            "菊科"
        ),
        FlowersItem(
            4,
            "Tulip",
            "鬱金香",
            "Tulipa gesneriana",
            "博愛、體貼、高雅、富貴、能幹、聰穎。",
            "常用於脾胃濕濁，胸脘滿悶，嘔逆腹痛，口臭苔膩。",
            "草本植物，鱗莖扁圓錐形或扁卵圓形，長約2公分，具棕褐色皮股，外包覆淡黃色纖維狀皮膜。莖葉光滑。葉有3 ~ 5片，為長橢圓狀披針形或卵狀披針形，長10 ~ 20公分，寬1 ~ 5公分。花莖高6 ~ 10公分，花單生直立莖頂。花葶長35 ~ 55公分；直立花單生，長約5 ~ 8公分；花瓣6片成倒卵形，有鮮黃色或紫紅色，也有黃色條紋和斑點。花期一般為3 至5月盛開。",
            "鬱金香屬",
            "百合科"
        ),
    )
}